In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [10]:
%%sql
SELECT * FROM facts LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [11]:
%%sql
SELECT MIN(population),MAX(population),MIN(population_growth),MAX(population_growth)
FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [12]:
%%sql
SELECT NAME FROM facts
WHERE population=(SELECT MIN(population) FROM facts);

Done.

[('Antarctica',)]

In [14]:
%%sql
SELECT NAME FROM facts
WHERE population=(SELECT MAX(population) FROM facts);

Done.

[('World',)]

In [15]:
%%sql
SELECT MIN(population) FROM facts
WHERE population!=(SELECT MIN(population) FROM facts);

Done.

[(48,)]

In [16]:
%%sql
SELECT MAX(population) FROM facts
WHERE population!=(SELECT MAX(population) FROM facts);

Done.

[(1367485388,)]

In [17]:
%%sql
SELECT name FROM facts WHERE POPULATION=(SELECT MAX(population) FROM facts
WHERE population!=(SELECT MAX(population) FROM facts));

Done.

[('China',)]

In [19]:
%%sql
SELECT MIN(population_growth) FROM facts
WHERE population_growth!=(SELECT MIN(population_growth) FROM facts);

Done.

[(0.01,)]

In [20]:
%%sql
SELECT MAX(population_growth) FROM facts
WHERE population_growth!=(SELECT MAX(population_growth) FROM facts);

Done.

[(3.32,)]

In [23]:
%%sql
SELECT AVG(population) FROM facts;

Done.

[(62094928.32231405,)]

In [24]:
%%sql
SELECT AVG(area) FROM facts;

Done.

[(555093.546184739,)]

In [26]:
%%sql
SELECT name FROM facts
WHERE population>(SELECT AVG(population) FROM facts) AND area<(SELECT AVG(area) FROM facts);

Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]